Ruby/project/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    if @student.save
---
INSERT INTO "students" ("first_name", "middle_name", "last_name", "group", "algebra_score", "geometry_score", "computer_science_score", "created_at", "updated_at", "freshman_state") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @student = Student.find(params[:id])

    if @student.update(student_params)
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "algebra_score" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["algebra_score", 2], ["updated_at", "2023-12-01 20:20:54.080222"], ["id", 1]]