Ruby/project/app/controllers/tasks_controller.rb

  def percentage_of_students_with_high_grades
    @percentage = percentage_of_students_with_high_grades(Student.all, 4, 5)
---
SELECT "students".* FROM "students"